export type Column = {
  key: string
  label: string
  width?: number
  align?: 'left' | 'right' | 'center'
}

export type Row = {
  [key: string]: string | number | boolean
} & {
  highlight?: boolean
}

export type TableConfig = {
  label?: string
  data?: Row[]
  columns: Column[]
  mobileWidth?: number
  filter?: (row: Row) => boolean
}

export const keys: Record<
  string,
  {
    title: string
    footnotes: string[]
    gridColumns?: number
    tables: TableConfig[]
    wide?: boolean
    highlightColor?: string
    highlightHoverColor?: string
  }
> = {
  T01: {
    title: '六都議員最常提哪些主題的分配型議案？',
    footnotes: [
      '註：僅統計本屆議員分配型提案，自2022年12月至2025年3月',
      '資料來源：六都議會提案系統、報導者觀測站',
      '資料整理：黃靖緯　｜　設計：江世民',
    ],
    tables: [
      {
        data: [
          { 主題: '醫療補助（癌症篩檢、疫苗）', 次數: 296 },
          { 主題: '敬老卡相關補助', 次數: 150 },
          { 主題: '原住民權益', 次數: 130 },
          { 主題: '鄰里（長）補助', 次數: 127 },
          { 主題: '生育相關補助', 次數: 95 },
        ],
        columns: [
          { key: '主題', label: '主題' },
          { key: '次數', label: '提案次數', align: 'center' },
        ],
      },
    ],
  },
  T02: {
    title: '兩大政黨相對關注主題前五名，國民黨支持者導向、民進黨關注特定族群',
    footnotes: [
      '註1：《報導者》使用代表性係數（Representation Index）統計各政黨相較於其他政黨更常提出的主題類別',
      '註2：各主題代表性係數計算方式：（政黨該主題提案人次／該主題總提案人次）／（政黨總提案人次／總提案人次）',
      '註3：僅統計本屆議員分配型提案，自2022年12月至2025年3月',
      '資料來源：六都議會提案系統、報導者觀測站',
      '資料整理：黃靖緯　｜　設計：江世民',
    ],
    tables: [
      {
        data: [
          { 國民黨: '志工待遇與福利\n（環保志工、義警義消、巡守隊）', 民進黨: '月經平權' },
          { 國民黨: '爭取中央補助', 民進黨: '市民卡、數位點數與資訊平台' },
          { 國民黨: '長照相關', 民進黨: '醫療補助（癌症篩檢、疫苗）' },
          { 國民黨: '鄰里（長）補助', 民進黨: '運動選手、產業補助' },
          { 國民黨: '緊急救助與防災教育類', 民進黨: '長者健保免費' },
        ],
        columns: [
          { key: '國民黨', label: '國民黨', align: 'center' },
          { key: '民進黨', label: '民進黨', align: 'center' },
        ],
      },
    ],
  },
  T03: {
    title: '傅兆林訃聞列名義子義女，人脈橫跨政商與地方組織',
    footnotes: [
      '註：本表僅列出有公開資訊之人物，非完整列表',
      '資料來源：2018年傅兆林訃聞',
      '資料整理：簡毅慧　｜　設計：江世民',
    ],
    tables: [
      {
        data: [
          { "類別": "民代／公務員", "姓名": "何禮臺", "身份": "花蓮縣新城鄉鄉長" },
          { "類別": "民代／公務員", "姓名": "龔文俊", "身份": "花蓮縣玉里鎮鎮長" },
          { "類別": "民代／公務員", "姓名": "郭仁添", "身份": "花蓮縣吉安鄕永安村村長、吉安鄉村長聯誼會會長" },
          { "類別": "民代／公務員", "姓名": "俞慧君", "身份": "花蓮縣花蓮市國興里里長" },
          { "類別": "民代／公務員", "姓名": "黃增樟", "身份": "花蓮縣警察局交通隊隊長" },
          { "類別": "民代／公務員", "姓名": "林泰旭", "身份": "花蓮縣光復鄉民代表會前主席" },
          { "類別": "民代／公務員", "姓名": "饒瑞逸", "身份": "花蓮縣花蓮市公所前工務課長" },
          { "類別": "民代／公務員", "姓名": "黃一釗", "身份": "花蓮縣鳳林地政事務所主任" },
          { "類別": "地方組織人士", "姓名": "黃裕國", "身份": "花蓮導遊領隊協會理事長、紅十字會花蓮縣支會總幹事" },
          { "類別": "地方組織人士", "姓名": "沈君茹", "身份": "花蓮社區大學校長" },
          { "類別": "企業經營者", "姓名": "邱創正", "身份": "宏懿營造、懿國企業前負責人" },
          { "類別": "企業經營者", "姓名": "黃長煌", "身份": "勝安景觀工程負責人" },
          { "類別": "企業經營者", "姓名": "蔡毓宏", "身份": "欣悅建設、連科金興業負責人" },
          { "類別": "企業經營者", "姓名": "蕭毅群", "身份": "利英工礦董事長" },
          { "類別": "企業經營者", "姓名": "余國基", "身份": "宗泰食品負責人" },
          { "類別": "企業經營者", "姓名": "高俊榮", "身份": "廣隆進企業負責人" },
          { "類別": "企業經營者", "姓名": "陳昌陞", "身份": "建宏電器行負責人（已歇業）" },
          { "類別": "企業經營者", "姓名": "鮑廣廷", "身份": "榮亮公司負責人" }
        ],
        columns: [
          { key: '類別', label: '類別' },
          { key: '姓名', label: '姓名' },
          { key: '身份', label: '身分' },
        ],
      },
    ],
  },
  T04: {
    title: '花蓮縣府前11大「標案王」，蘇色萍家族企業占5名',
    footnotes: [
      '註：本表取2010至2025年傅崐萁夫婦擔任花蓮縣長期間，花縣府及一級子機關之決標案件',
      '資料來源：台灣採購公報網',
      '資料整理：簡毅慧　｜　設計：江世民',
    ],
    highlightColor: 'var(--chart-blue-1)',
    highlightHoverColor: 'var(--chart-blue-2)',
    tables: [
      {
        data: [
          { "排名": 1, "公司": "大鵬土木包工業", "負責人": "黃李親鵬", "公司登記": "花蓮縣花蓮市國興里建華路83巷16號1樓", "得標案件數": 130, "累計得標金額": 204188000, "累計得標金額_中文": "2億419萬" },
          { "排名": 2, "公司": "順鴻土木包工業", "負責人": "李錦松", "公司登記": "花蓮縣壽豐鄉豐坪村東坪街14號", "得標案件數": 123, "累計得標金額": 279063143, "累計得標金額_中文": "2億7,906萬" },
          { "排名": 3, "公司": "承太營造有限公司", "負責人": "廖柔柔、蘇色萍", "公司登記": "花蓮縣花蓮市國富里國富二街67號1樓", "得標案件數": 120, "累計得標金額": 1740734586, "累計得標金額_中文": "17億4,073萬", "highlight": true },
          { "排名": 4, "公司": "平順土木包工業", "負責人": "廖政文", "公司登記": "花蓮縣吉安鄉北昌村自樂街46巷3號1樓", "得標案件數": 112, "累計得標金額": 274303063, "累計得標金額_中文": "2億7,430萬", "highlight": true },
          { "排名": 5, "公司": "原鄉興業有限公司", "負責人": "魏英美", "公司登記": "花蓮縣花蓮市國安里8鄰復興街79巷1號", "得標案件數": 100, "累計得標金額": 59775465, "累計得標金額_中文": "5,978萬" },
          { "排名": 6, "公司": "長太土木包工業", "負責人": "巫涵妮", "公司登記": "花蓮縣吉安鄉勝安村自立二街6巷6號1樓", "得標案件數": 96, "累計得標金額": 131440671, "累計得標金額_中文": "1億3,144萬", "highlight": true },
          { "排名": 7, "公司": "台典工程顧問股份有限公司", "負責人": "林志誠", "公司登記": "花蓮縣花蓮市主權里7鄰中原路631號", "得標案件數": 93, "累計得標金額": 653684108, "累計得標金額_中文": "6億5,368萬" },
          { "排名": 8, "公司": "光點整合行銷有限公司", "負責人": "魏夏代", "公司登記": "花蓮縣花蓮市國防里1鄰進豐街62-2號", "得標案件數": 90, "累計得標金額": 284793213, "累計得標金額_中文": "2億8,479萬" },
          { "排名": 9, "公司": "承建營造有限公司", "負責人": "呂秉承", "公司登記": "花蓮縣玉里鎮中城里25鄰中山路一段197號3樓之2；花蓮縣玉里鎮泰昌里4鄰民權街88巷4號4樓", "得標案件數": 90, "累計得標金額": 219808487, "累計得標金額_中文": "2億1,981萬" },
          { "排名": 10, "公司": "長富營造有限公司", "負責人": "蘇春蓮、廖冠宇", "公司登記": "花蓮縣花蓮市富裕十街53巷11號1樓", "得標案件數": 83, "累計得標金額": 2317544762, "累計得標金額_中文": "23億1,754萬", "highlight": true },
          { "排名": 11, "公司": "大安土木包工業", "負責人": "廖政武", "公司登記": "花蓮縣吉安鄉勝安村自立二街六巷5號一樓；花蓮縣吉安鄉勝安村自立二街6巷6號2樓；花蓮縣花蓮市主信里南京街203號6樓之12", "得標案件數": 79, "累計得標金額": 182597024, "累計得標金額_中文": "1億8,260萬", "highlight": true }
        ],
        columns: [
          { key: '排名', label: '', align: 'center' },
          { key: '公司', label: '公司' },
          { key: '負責人', label: '歷任負責人' },
          { key: '得標案件數', label: '得標案件數' },
          { key: '累計得標金額_中文', label: '累計得標金額' }
        ],
        mobileWidth: 150,
      },
    ],
  },
  T05: {
    title: '2024年立委選舉，18位候選人以「製作競選物品」為由向戰天下支出近800萬',
    footnotes: [
      '資料來源：監察院政治獻金公開查閱平台',
      '資料整理：簡毅慧　｜　設計：江世民',
    ],
    tables: [
      {
        data: [
          { "立委候選人": "羅廷瑋、鄭正鈐、葉元之、黃仁、呂玉玲、李眉蓁", "個別採購金額": "56萬100" },
          { "立委候選人": "李彥秀、陳超明、徐欣瑩、黃明賢、黃琤婷", "個別採購金額": "50萬8,100" },
          { "立委候選人": "王鴻薇", "個別採購金額": "493,600" },
          { "立委候選人": "魯明哲、阮厚爵", "個別採購金額": "28萬7,300" },
          { "立委候選人": "游淑慧、洪孟楷", "個別採購金額": "27萬2,800" },
          { "立委候選人": "林德福、鄭俊雄", "個別採購金額": "22萬0,800" }
        ],
        columns: [
          { key: '立委候選人', label: '立委候選人' },
          { key: '個別採購金額', label: '個別採購金額', align: 'center' }
        ]
      },
    ],
  },
  T06: {
    title: '戰天下整合行銷客戶，以花蓮在地候選人為主',
    footnotes: [
      '資料來源：監察院政治獻金公開查閱平台',
      '資料整理：簡毅慧　｜　設計：江世民',
    ],
    tables: [
      {
        data: [
          { "選舉項目": "2018花蓮縣縣長選舉", "候選人": "徐榛蔚", "採購金額": "298萬7,670" },
          { "選舉項目": "2022花蓮縣議員選舉", "候選人": "徐子芳", "採購金額": "22萬9,100" },
          { "選舉項目": "2022花蓮縣新城鄉鄉長選舉", "候選人": "何禮臺", "採購金額": "20萬5,000" },
          { "選舉項目": "2022花蓮縣花蓮市市長選舉", "候選人": "魏嘉彥", "採購金額": "14萬7,000" },
          { "選舉項目": "2022花蓮縣花蓮市市民代表選舉", "候選人": "娃娃．攸攸WAWA．YUYUH", "採購金額": "1萬2,000" },
          { "選舉項目": "2024立法委員選舉", "候選人": "孔文吉", "採購金額": "8萬1,000" },
          { "選舉項目": "2024總統、副總統選舉", "候選人": "侯友宜", "採購金額": "1萬5,000" }
        ],
        columns: [
          { key: '選舉項目', label: '選舉項目' },
          { key: '候選人', label: '候選人' },
          { key: '採購金額', label: '採購金額', align: 'center' }
        ]
      },
    ],
  },
  TG01: {
    wide: true,
    title: '六都前三名分配型提案主題',
    footnotes: [
      '註：僅統計本屆議員分配型提案，自2022年12月至2025年3月',
      '資料來源：六都議會提案系統、報導者觀測站',
      '資料整理：黃靖緯　｜　設計：江世民',
    ],
    gridColumns: 3,
    tables: ['台北市', '新北市', '桃園市', '台中市', '台南市', '高雄市'].map(
      (city) => ({
        label: city,
        data: [
          {
            縣市: '台北市',
            標籤名稱: '醫療補助（癌症篩檢、疫苗）',
            占比: '17.82%',
          },
          { 縣市: '台北市', 標籤名稱: '生育相關補助', 占比: '8.91%' },
          { 縣市: '台北市', 標籤名稱: '鄰里（長）補助', 占比: '7.92%' },
          {
            縣市: '新北市',
            標籤名稱: '醫療補助（癌症篩檢、疫苗）',
            占比: '11.68%',
          },
          { 縣市: '新北市', 標籤名稱: '原住民權益', 占比: '9.12%' },
          { 縣市: '新北市', 標籤名稱: '敬老卡相關補助', 占比: '5.98%' },
          {
            縣市: '桃園市',
            標籤名稱: '醫療補助（癌症篩檢、疫苗）',
            占比: '11.90%',
          },
          { 縣市: '桃園市', 標籤名稱: '敬老卡相關補助', 占比: '6.80%' },
          { 縣市: '桃園市', 標籤名稱: '交通運輸相關', 占比: '3.86%' },
          { 縣市: '台中市', 標籤名稱: '教育、學校與學生補助', 占比: '10.72%' },
          { 縣市: '台中市', 標籤名稱: '鄰里（長）補助', 占比: '8.31%' },
          {
            縣市: '台中市',
            標籤名稱: '醫療補助（癌症篩檢、疫苗）',
            占比: '6.97%',
          },
          {
            縣市: '台南市',
            標籤名稱: '醫療補助（癌症篩檢、疫苗）',
            占比: '9.36%',
          },
          { 縣市: '台南市', 標籤名稱: '原住民權益', 占比: '5.78%' },
          { 縣市: '台南市', 標籤名稱: '鄰里（長）補助', 占比: '5.58%' },
          {
            縣市: '高雄市',
            標籤名稱: '醫療補助（癌症篩檢、疫苗）',
            占比: '14.56%',
          },
          {
            縣市: '高雄市',
            標籤名稱: '社福設施、社會住宅、活動中心',
            占比: '9.49%',
          },
          { 縣市: '高雄市', 標籤名稱: '住宅安全', 占比: '5.70%' },
        ],
        filter: (row) => row['縣市'] === city,
        columns: [
          { key: '標籤名稱', label: '主題' },
          { key: '占比', label: '占比', width: 0.25, align: 'center' },
        ],
      }),
    ),
  },
}
